package com.dhcc.nursepro.workarea.nurrecordold.bean;

import java.util.List;

public class InWardPatListBean {

    /**
     * msg : 成功
     * msgcode : 999999
     * patInfoList : [{"age":"19岁","allOut":"0","arreag":"0","bedCode":"01","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"1","episodeId":"640","fever":"0","gotAllergy":"0","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"张三","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000303","主管护士":"汪丽华","住址":"","住院天数":"1","入科":"2019-07-18 09:54","入院":"2019-07-18 09:54:26","出院状态":"医嘱出院 ","医保号":"","医生":"高洪媛","周天数":"第1天","就诊号":"640","年龄":"19岁","床位号":"01","性别":"男","总费用":"96.37","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"903.63","术后天数":"","民族":"汉族","病人姓名":"张三","病区":"内分泌科护理单元","病情":"普通","病案号":"100144","登记时间":"2019-07-18 09:34:54","科室":"内分泌科","联系人":"","联系电话":"13215151515","诊断":"高血压1级,脑内出血","费别":"全自费","身份证":""},"regNo":"0000000303","seq":"1","sex":"男","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"21岁","allOut":"0","arreag":"0","bedCode":"02","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"588","fever":"1","gotAllergy":"0","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"玉天恒","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000294","主管护士":"汪丽华","住址":"","住院天数":"7","入科":"2019-07-12 08:51","入院":"2019-07-12 08:51:38","出院状态":"","医保号":"","医生":"高洪媛","周天数":"第1周/第0天","就诊号":"588","年龄":"21岁","床位号":"02","性别":"男","总费用":"0","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"50000.00","术后天数":"","民族":"汉族","病人姓名":"玉天恒","病区":"内分泌科护理单元","病情":"普通","病案号":"100140","登记时间":"2019-02-27 10:22:20","科室":"内分泌科","联系人":"","联系电话":"","诊断":"","费别":"全自费","身份证":""},"regNo":"0000000294","seq":"2","sex":"男","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"31岁","allOut":"0","arreag":"0","bedCode":"03","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"396","fever":"0","gotAllergy":"0","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"英布","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000224","主管护士":"汪丽华 护士01","住址":"","住院天数":"149","入科":"2019-02-27 10:59","入院":"2019-02-20 10:59:14","出院状态":"","医保号":"","医生":"高洪媛","周天数":"第21周/第2天","就诊号":"396","年龄":"31岁","床位号":"03","性别":"男","总费用":"263.25","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"49736.75","术后天数":"","民族":"汉族","病人姓名":"英布","病区":"内分泌科护理单元","病情":"普通","病案号":"100108","登记时间":"2019-02-18 09:43:37","科室":"内分泌科","联系人":"","联系电话":"15662017332","诊断":"发热","费别":"全自费","身份证":""},"regNo":"0000000224","seq":"3","sex":"男","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"32岁","allOut":"0","arreag":"1","bedCode":"04","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"5","fever":"0","gotAllergy":"0","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"花花","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000009","主管护士":"护士01","住址":"","住院天数":"169","入科":"2019-01-31 15:02","入院":"2019-01-31 15:02:28","出院状态":"","医保号":"","医生":"医生01","周天数":"第24周/第1天","就诊号":"5","年龄":"32岁","床位号":"04","性别":"男","总费用":"1092","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"-1092.00","术后天数":"","民族":"","病人姓名":"花花","病区":"内分泌科护理单元","病情":"普通","病案号":"100019","登记时间":"2019-01-31 14:56:21","科室":"内分泌科","联系人":"","联系电话":"13484583648","诊断":"伤寒性脑膜炎","费别":"全自费","身份证":""},"regNo":"0000000009","seq":"4","sex":"男","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"32岁","allOut":"0","arreag":"0","bedCode":"05","careLevel":"二级护理","criticalValue":"0","dangerous":"1","docDisch":"0","episodeId":"1","fever":"0","gotAllergy":"0","illState":"病危","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"秦海贤","newPatient":"0","operation":"1","patInfoDetail":{"ID":"0000000001","主管护士":"护士01 李秀琴[1900]","住址":"","住院天数":"170","入科":"2019-01-30 17:01","入院":"2019-01-30 17:01:06","出院状态":"","医保号":"","医生":"医生01","周天数":"第24周/第2天","就诊号":"1","年龄":"32岁","床位号":"05","性别":"男","总费用":"2896.76","房间":"内分泌1病室","手术":"头部血管治疗性超声","护理级别":"二级护理","押金余额":"47103.24","术后天数":"","民族":"","病人姓名":"秦海贤","病区":"内分泌科护理单元","病情":"病危","病案号":"100001","登记时间":"2019-01-30 16:59:43","科室":"内分泌科","联系人":"","联系电话":"13426096345","诊断":"咳嗽病,风证类,非ICD诊断,tt","费别":"全自费","身份证":"360822198609284091 "},"regNo":"0000000001","seq":"5","sex":"男","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"19岁","allOut":"0","arreag":"0","bedCode":"06","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"7","fever":"0","gotAllergy":"0","illState":"病重","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"myh测试","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000012","主管护士":"护士01","住址":"","住院天数":"169","入科":"2019-01-31 15:55","入院":"2019-01-31 15:55:11","出院状态":"","医保号":"","医生":"医生01","周天数":"第24周/第1天","就诊号":"7","年龄":"19岁","床位号":"06","性别":"女","总费用":"2387.5","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"97612.50","术后天数":"","民族":"","病人姓名":"myh测试","病区":"内分泌科护理单元","病情":"病重","病案号":"100004","登记时间":"2019-01-31 15:16:06","科室":"内分泌科","联系人":"","联系电话":"13355224477","诊断":"伤寒性肝炎,乙肝表面抗原携带者,乳腺癌","费别":"全自费","身份证":""},"regNo":"0000000012","seq":"6","sex":"女","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"30岁","allOut":"0","arreag":"0","bedCode":"07","careLevel":"二级护理","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"97","fever":"0","gotAllergy":"0","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"临床路径","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000085","主管护士":"","住址":"","住院天数":"167","入科":"2019-02-02 10:04","入院":"2019-02-02 10:04:34","出院状态":"","医保号":"","医生":"医生01","周天数":"第23周/第6天","就诊号":"97","年龄":"30岁","床位号":"07","性别":"男","总费用":"1206.95","房间":"内分泌1病室","手术":"","护理级别":"二级护理","押金余额":"8793.05","术后天数":"","民族":"","病人姓名":"临床路径","病区":"内分泌科护理单元","病情":"普通","病案号":"100032","登记时间":"2019-02-02 10:02:51","科室":"内分泌科","联系人":"","联系电话":"","诊断":"乳腺肿瘤","费别":"全自费","身份证":""},"regNo":"0000000085","seq":"7","sex":"男","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"26岁","allOut":"0","arreag":"0","bedCode":"08","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"24","fever":"0","gotAllergy":"0","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"住院00","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000037","主管护士":"","住址":"","住院天数":"169","入科":"2019-01-31 17:44","入院":"2019-01-31 17:44:42","出院状态":"","医保号":"","医生":"医生01","周天数":"第24周/第1天","就诊号":"24","年龄":"26岁","床位号":"08","性别":"未知性别","总费用":"896","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"9104.00","术后天数":"","民族":"汉族","病人姓名":"住院00","病区":"内分泌科护理单元","病情":"普通","病案号":"100007","登记时间":"2019-01-31 17:42:34","科室":"内分泌科","联系人":"","联系电话":"15651961517","诊断":"乳腺肿瘤","费别":"全自费","身份证":""},"regNo":"0000000037","seq":"8","sex":"未知性别","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"26岁","allOut":"0","arreag":"0","bedCode":"09","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"41","fever":"0","gotAllergy":"1","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"住院","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000048","主管护士":"","住址":"","住院天数":"168","入科":"2019-02-01 09:56","入院":"2019-02-01 09:56:50","出院状态":"","医保号":"","医生":"医生01","周天数":"第24周/第0天","就诊号":"41","年龄":"26岁","床位号":"09","性别":"男","总费用":"1116.75","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"998883.25","术后天数":"","民族":"","病人姓名":"住院","病区":"内分泌科护理单元","病情":"普通","病案号":"100012","登记时间":"2019-02-01 09:46:07","科室":"内分泌科","联系人":"","联系电话":"","诊断":"冻伤,肩胛区结缔组织良性肿瘤,肩胛区结缔组织良性肿瘤","费别":"全自费","身份证":"370982198704221033 "},"regNo":"0000000048","seq":"9","sex":"男","skinOrd":[{"arcimName":"青霉素G钠","skinTestInfo":"阳性","stDate":"2019-07-17"}],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"41岁","allOut":"0","arreag":"0","bedCode":"10","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"36","fever":"0","gotAllergy":"0","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"yw魏嘉志","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000032","主管护士":"护士01","住址":"","住院天数":"168","入科":"2019-02-01 09:31","入院":"2019-02-01 09:31:20","出院状态":"","医保号":"","医生":"李文明","周天数":"第24周/第0天","就诊号":"36","年龄":"41岁","床位号":"10","性别":"男","总费用":"949","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"9251.00","术后天数":"","民族":"","病人姓名":"yw魏嘉志","病区":"内分泌科护理单元","病情":"普通","病案号":"100010","登记时间":"2019-02-01 09:22:16","科室":"内分泌科","联系人":"","联系电话":"15567898909","诊断":"咳嗽","费别":"全自费","身份证":"440901197709194316 "},"regNo":"0000000032","seq":"10","sex":"男","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"20岁","allOut":"0","arreag":"0","bedCode":"11","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"43","fever":"0","gotAllergy":"0","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"第二也是我","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000023","主管护士":"李秀琴[1900]","住址":"","住院天数":"168","入科":"2019-02-01 09:57","入院":"2019-02-01 09:57:08","出院状态":"","医保号":"","医生":"高洪媛","周天数":"第24周/第0天","就诊号":"43","年龄":"20岁","床位号":"11","性别":"女","总费用":"864","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"99136.00","术后天数":"","民族":"","病人姓名":"第二也是我","病区":"内分泌科护理单元","病情":"普通","病案号":"100013","登记时间":"2019-02-01 09:52:34","科室":"内分泌科","联系人":"","联系电话":"13332322525","诊断":"功能性咳嗽","费别":"全自费","身份证":""},"regNo":"0000000023","seq":"11","sex":"女","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"48岁","allOut":"0","arreag":"0","bedCode":"12","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"38","fever":"0","gotAllergy":"0","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"yw柏雅惠","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000033","主管护士":"护士01","住址":"","住院天数":"168","入科":"2019-02-01 09:31","入院":"2019-02-01 09:31:38","出院状态":"","医保号":"","医生":"孟玉秀","周天数":"第24周/第0天","就诊号":"38","年龄":"48岁","床位号":"12","性别":"女","总费用":"864","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"99136.00","术后天数":"","民族":"","病人姓名":"yw柏雅惠","病区":"内分泌科护理单元","病情":"普通","病案号":"100011","登记时间":"2019-02-01 09:24:48","科室":"内分泌科","联系人":"","联系电话":"15678989898","诊断":"","费别":"全自费","身份证":"440901197103148286 "},"regNo":"0000000033","seq":"12","sex":"女","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"22岁","allOut":"0","arreag":"0","bedCode":"13","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"108","fever":"0","gotAllergy":"0","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"myh预住院2","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000089","主管护士":"护士01","住址":"","住院天数":"167","入科":"2019-02-02 11:28","入院":"2019-02-02 11:28:05","出院状态":"","医保号":"","医生":"医生01","周天数":"第23周/第6天","就诊号":"108","年龄":"22岁","床位号":"13","性别":"女","总费用":"1424.4","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"98693.60","术后天数":"","民族":"汉族","病人姓名":"myh预住院2","病区":"内分泌科护理单元","病情":"普通","病案号":"100036","登记时间":"2019-02-02 11:27:14","科室":"内分泌科","联系人":"","联系电话":"18756856565","诊断":"霍乱，由于O1群霍乱弧菌，霍乱生物型所致","费别":"全自费","身份证":""},"regNo":"0000000089","seq":"13","sex":"女","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"1月8天","allOut":"0","arreag":"0","bedCode":"14","careLevel":"","criticalValue":"1","dangerous":"0","docDisch":"0","episodeId":"162","fever":"0","gotAllergy":"0","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"高兴","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000130","主管护士":"护士01","住址":"","住院天数":"6","入科":"2019-02-12 13:50","入院":"2019-02-12 13:50:59","出院状态":"医嘱出院 ","医保号":"","医生":"医生01","周天数":"第6天","就诊号":"162","年龄":"1月8天","床位号":"14","性别":"女","总费用":"565.34","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"1434.66","术后天数":"","民族":"汉族","病人姓名":"高兴","病区":"内分泌科护理单元","病情":"普通","病案号":"100048","登记时间":"2019-02-12 12:56:51","科室":"内分泌科","联系人":"","联系电话":"","诊断":"功能性咳嗽,功能性咳嗽","费别":"全自费","身份证":""},"regNo":"0000000130","seq":"14","sex":"女","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"30岁","allOut":"0","arreag":"0","bedCode":"15","careLevel":"二级护理","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"385","fever":"0","gotAllergy":"0","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"临床路径2","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000220","主管护士":"","住址":"","住院天数":"151","入科":"2019-02-18 09:10","入院":"2019-02-18 09:10:23","出院状态":"","医保号":"","医生":"医生01","周天数":"第21周/第4天","就诊号":"385","年龄":"30岁","床位号":"15","性别":"男","总费用":"320","房间":"内分泌1病室","手术":"","护理级别":"二级护理","押金余额":"9680.00","术后天数":"","民族":"汉族","病人姓名":"临床路径2","病区":"内分泌科护理单元","病情":"普通","病案号":"100102","登记时间":"2019-02-18 09:00:50","科室":"内分泌科","联系人":"","联系电话":"","诊断":"乳腺肿瘤","费别":"全自费","身份证":""},"regNo":"0000000220","seq":"15","sex":"男","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"43岁","allOut":"0","arreag":"0","bedCode":"16","careLevel":"一级护理","criticalValue":"0","dangerous":"1","docDisch":"0","episodeId":"52","fever":"0","gotAllergy":"1","illState":"病危","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"C位","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000050","主管护士":"","住址":"","住院天数":"168","入科":"2019-02-01 10:19","入院":"2019-02-01 10:19:03","出院状态":"","医保号":"","医生":"医生01","周天数":"第24周/第0天","就诊号":"52","年龄":"43岁","床位号":"16","性别":"男","总费用":"1166","房间":"内分泌1病室","手术":"","护理级别":"一级护理","押金余额":"998834.00","术后天数":"","民族":"汉族","病人姓名":"C位","病区":"内分泌科护理单元","病情":"病危","病案号":"100017","登记时间":"2019-02-01 10:17:09","科室":"内分泌科","联系人":"","联系电话":"19966666666","诊断":"冻伤,手痛","费别":"全自费","身份证":"522121197603177634 "},"regNo":"0000000050","seq":"16","sex":"男","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"42岁","allOut":"0","arreag":"0","bedCode":"17","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"289","fever":"0","gotAllergy":"0","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"cl边雪pc","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000170","主管护士":"护士01","住址":"","住院天数":"155","入科":"2019-02-14 11:10","入院":"2019-02-14 11:10:40","出院状态":"","医保号":"","医生":"医生01","周天数":"第22周/第1天","就诊号":"289","年龄":"42岁","床位号":"17","性别":"女","总费用":"654","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"999346.00","术后天数":"","民族":"汉族","病人姓名":"cl边雪pc","病区":"内分泌科护理单元","病情":"普通","病案号":"100076","登记时间":"2019-02-14 11:07:51","科室":"内分泌科","联系人":"","联系电话":"13676543234","诊断":"头痛","费别":"全自费","身份证":"360822197706163166 "},"regNo":"0000000170","seq":"17","sex":"女","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"21岁","allOut":"0","arreag":"0","bedCode":"18","careLevel":"","criticalValue":"1","dangerous":"0","docDisch":"0","episodeId":"55","fever":"0","gotAllergy":"1","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"住院2","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000051","主管护士":"","住址":"","住院天数":"168","入科":"2019-02-01 10:28","入院":"2019-02-01 10:28:24","出院状态":"","医保号":"","医生":"医生01","周天数":"第24周/第0天","就诊号":"55","年龄":"21岁","床位号":"18","性别":"女","总费用":"1381.68","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"98618.32","术后天数":"","民族":"汉族","病人姓名":"住院2","病区":"内分泌科护理单元","病情":"普通","病案号":"100018","登记时间":"2019-02-01 10:27:32","科室":"内分泌科","联系人":"","联系电话":"19965654545","诊断":"产伤","费别":"全自费","身份证":""},"regNo":"0000000051","seq":"18","sex":"女","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"26岁","allOut":"0","arreag":"0","bedCode":"19","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"57","fever":"0","gotAllergy":"0","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"住院3","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000054","主管护士":"","住址":"","住院天数":"168","入科":"2019-02-01 10:51","入院":"2019-02-01 10:51:54","出院状态":"医生撤销出院","医保号":"","医生":"医生01","周天数":"第24周/第0天","就诊号":"57","年龄":"26岁","床位号":"19","性别":"男","总费用":"970.96","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"999029.04","术后天数":"","民族":"汉族","病人姓名":"住院3","病区":"内分泌科护理单元","病情":"普通","病案号":"100020","登记时间":"2019-02-01 10:39:48","科室":"内分泌科","联系人":"","联系电话":"","诊断":"阿哥拉沙门菌肠炎,冻伤,高血压1级","费别":"全自费","身份证":""},"regNo":"0000000054","seq":"19","sex":"男","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"22岁","allOut":"0","arreag":"0","bedCode":"20","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"62","fever":"0","gotAllergy":"0","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"住院5","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000060","主管护士":"","住址":"","住院天数":"168","入科":"2019-02-01 11:22","入院":"2019-02-01 11:22:31","出院状态":"","医保号":"","医生":"医生01","周天数":"第24周/第0天","就诊号":"62","年龄":"22岁","床位号":"20","性别":"女","总费用":"2123.36","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"97876.64","术后天数":"","民族":"汉族","病人姓名":"住院5","病区":"内分泌科护理单元","病情":"普通","病案号":"100023","登记时间":"2019-02-01 11:18:23","科室":"内分泌科","联系人":"","联系电话":"18784546565","诊断":"中暑病","费别":"全自费","身份证":""},"regNo":"0000000060","seq":"20","sex":"女","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"44岁","allOut":"0","arreag":"1","bedCode":"21","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"186","fever":"0","gotAllergy":"0","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"yw殷伟诚","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000142","主管护士":"护士01","住址":"","住院天数":"157","入科":"2019-02-12 14:46","入院":"2019-02-12 14:46:44","出院状态":"","医保号":"","医生":"孟玉秀","周天数":"第22周/第3天","就诊号":"186","年龄":"44岁","床位号":"21","性别":"男","总费用":"512","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"-512.00","术后天数":"","民族":"汉族","病人姓名":"yw殷伟诚","病区":"内分泌科护理单元","病情":"普通","病案号":"100057","登记时间":"2019-02-12 14:42:34","科室":"内分泌科","联系人":"","联系电话":"15567898909","诊断":"流行性感冒","费别":"全自费","身份证":"440901197502108337 "},"regNo":"0000000142","seq":"21","sex":"男","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"23岁","allOut":"0","arreag":"0","bedCode":"22","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"226","fever":"0","gotAllergy":"0","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"测试住院","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000153","主管护士":"","住址":"","住院天数":"156","入科":"2019-02-13 09:10","入院":"2019-02-13 09:10:23","出院状态":"","医保号":"","医生":"医生01","周天数":"第22周/第2天","就诊号":"226","年龄":"23岁","床位号":"22","性别":"女","总费用":"480","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"999520.00","术后天数":"","民族":"汉族","病人姓名":"测试住院","病区":"内分泌科护理单元","病情":"普通","病案号":"100062","登记时间":"2019-02-13 09:07:10","科室":"内分泌科","联系人":"","联系电话":"18865652323","诊断":"产伤","费别":"全自费","身份证":""},"regNo":"0000000153","seq":"22","sex":"女","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"36岁","allOut":"0","arreag":"0","bedCode":"23","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"1","episodeId":"303","fever":"0","gotAllergy":"0","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"张三","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000182","主管护士":"汪丽华","住址":"天津市市辖区东丽区","住院天数":"1","入科":"2019-02-14 16:20","入院":"2019-02-14 16:20:51","出院状态":"护士召回","医保号":"","医生":"苗健龙","周天数":"第1天","就诊号":"303","年龄":"36岁","床位号":"23","性别":"女","总费用":"448","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"999552.00","术后天数":"","民族":"汉族","病人姓名":"张三","病区":"内分泌科护理单元","病情":"普通","病案号":"100083","登记时间":"2019-02-14 16:17:35","科室":"内分泌科","联系人":"","联系电话":"13633366666","诊断":"头痛,喷嚏,闭病,湿毒证","费别":"全自费","身份证":"360822198305022623 "},"regNo":"0000000182","seq":"23","sex":"女","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"32岁","allOut":"0","arreag":"0","bedCode":"24","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"161","fever":"0","gotAllergy":"0","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"开心","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000129","主管护士":"","住址":"","住院天数":"151","入科":"2019-02-18 11:27","入院":"2019-02-18 11:27:28","出院状态":"","医保号":"","医生":"医生01","周天数":"第21周/第4天","就诊号":"161","年龄":"32岁","床位号":"24","性别":"男","总费用":"815.6","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"2184.40","术后天数":"","民族":"汉族","病人姓名":"开心","病区":"内分泌科护理单元","病情":"普通","病案号":"100047","登记时间":"2019-02-12 12:54:36","科室":"内分泌科","联系人":"","联系电话":"","诊断":"肩胛区结缔组织良性肿瘤","费别":"全自费","身份证":""},"regNo":"0000000129","seq":"24","sex":"男","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"25岁","allOut":"0","arreag":"0","bedCode":"25","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"135","fever":"0","gotAllergy":"0","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"myh0212","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000096","主管护士":"护士01","住址":"","住院天数":"157","入科":"2019-02-12 08:52","入院":"2019-02-12 08:52:07","出院状态":"","医保号":"","医生":"医生01","周天数":"第22周/第3天","就诊号":"135","年龄":"25岁","床位号":"25","性别":"女","总费用":"561","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"9448.00","术后天数":"","民族":"汉族","病人姓名":"myh0212","病区":"内分泌科护理单元","病情":"普通","病案号":"100038","登记时间":"2019-02-12 08:32:24","科室":"内分泌科","联系人":"","联系电话":"","诊断":"霍乱，由于O1群霍乱弧菌，埃尔托生物型所致,便秘","费别":"全自费","身份证":""},"regNo":"0000000096","seq":"25","sex":"女","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"25岁","allOut":"0","arreag":"0","bedCode":"26","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"1","episodeId":"250","fever":"0","gotAllergy":"0","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"myh测试1302","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000162","主管护士":"护士01","住址":"","住院天数":"2","入科":"2019-02-13 15:54","入院":"2019-02-13 15:54:57","出院状态":"医嘱出院 ","医保号":"","医生":"医生01","周天数":"第2天","就诊号":"250","年龄":"25岁","床位号":"26","性别":"女","总费用":"2298.3","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"-2289.30","术后天数":"","民族":"汉族","病人姓名":"myh测试1302","病区":"内分泌科护理单元","病情":"普通","病案号":"100069","登记时间":"2019-02-13 15:54:27","科室":"内分泌科","联系人":"","联系电话":"18562563652","诊断":"霍乱，由于O1群霍乱弧菌，霍乱生物型所致,便秘","费别":"全自费","身份证":""},"regNo":"0000000162","seq":"26","sex":"女","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"118岁","allOut":"0","arreag":"0","bedCode":"27","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"505","fever":"0","gotAllergy":"0","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"蚩尤","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000254","主管护士":"护士01","住址":"","住院天数":"149","入科":"2019-02-20 14:29","入院":"2019-02-20 14:29:52","出院状态":"","医保号":"","医生":"医生01","周天数":"第21周/第2天","就诊号":"505","年龄":"118岁","床位号":"27","性别":"男","总费用":"256","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"29744.00","术后天数":"","民族":"汉族","病人姓名":"蚩尤","病区":"内分泌科护理单元","病情":"普通","病案号":"100123","登记时间":"2019-02-20 14:28:47","科室":"消化内科","联系人":"","联系电话":"18678302119","诊断":"发热","费别":"全自费","身份证":""},"regNo":"0000000254","seq":"27","sex":"男","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"23岁","allOut":"0","arreag":"0","bedCode":"28","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"316","fever":"0","gotAllergy":"0","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"haha","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000190","主管护士":"护士01","住址":"","住院天数":"154","入科":"2019-02-15 10:05","入院":"2019-02-15 10:05:38","出院状态":"","医保号":"","医生":"医生01","周天数":"第22周/第0天","就诊号":"316","年龄":"23岁","床位号":"28","性别":"女","总费用":"639","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"1361.00","术后天数":"","民族":"汉族","病人姓名":"haha","病区":"内分泌科护理单元","病情":"普通","病案号":"100085","登记时间":"2019-02-15 10:05:17","科室":"内分泌科","联系人":"","联系电话":"13695248102","诊断":"上肢(包括肩)周围神经恶性肿瘤","费别":"职工医保","身份证":""},"regNo":"0000000190","seq":"28","sex":"女","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"29岁","allOut":"0","arreag":"0","bedCode":"29","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"351","fever":"0","gotAllergy":"0","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"myh1601","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000204","主管护士":"护士01","住址":"","住院天数":"153","入科":"2019-02-16 09:44","入院":"2019-02-16 09:44:58","出院状态":"医生撤销出院","医保号":"","医生":"医生01","周天数":"第21周/第6天","就诊号":"351","年龄":"29岁","床位号":"29","性别":"女","总费用":"638.59","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"9370.41","术后天数":"","民族":"汉族","病人姓名":"myh1601","病区":"内分泌科护理单元","病情":"普通","病案号":"100091","登记时间":"2019-02-16 09:42:27","科室":"内分泌科","联系人":"","联系电话":"","诊断":"伤寒性肝炎,便秘","费别":"全自费","身份证":""},"regNo":"0000000204","seq":"29","sex":"女","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"23岁","allOut":"0","arreag":"0","bedCode":"30","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"337","fever":"0","gotAllergy":"0","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"卡合并2","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000184","主管护士":"护士01","住址":"","住院天数":"154","入科":"2019-02-15 16:47","入院":"2019-02-15 16:47:30","出院状态":"医生撤销出院","医保号":"","医生":"医生01","周天数":"第22周/第0天","就诊号":"337","年龄":"23岁","床位号":"30","性别":"女","总费用":"422.9","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"499577.10","术后天数":"","民族":"汉族","病人姓名":"卡合并2","病区":"内分泌科护理单元","病情":"普通","病案号":"100089","登记时间":"2019-02-15 16:46:38","科室":"内分泌科","联系人":"","联系电话":"17647413191","诊断":"高血压1级,恶性高血压","费别":"全自费","身份证":""},"regNo":"0000000184","seq":"30","sex":"女","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"25岁","allOut":"0","arreag":"0","bedCode":"31","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"1","episodeId":"338","fever":"0","gotAllergy":"0","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"myh1507","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000202","主管护士":"护士01 李秀琴[1900]","住址":"","住院天数":"1","入科":"2019-02-15 17:16","入院":"2019-02-15 17:16:09","出院状态":"护士召回","医保号":"","医生":"医生01","周天数":"第1天","就诊号":"338","年龄":"25岁","床位号":"31","性别":"女","总费用":"418.71","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"9581.29","术后天数":"","民族":"汉族","病人姓名":"myh1507","病区":"内分泌科护理单元","病情":"普通","病案号":"100090","登记时间":"2019-02-15 17:13:23","科室":"内分泌科","联系人":"","联系电话":"","诊断":"伤寒性脑膜炎,便秘","费别":"全自费","身份证":""},"regNo":"0000000202","seq":"31","sex":"女","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"30岁","allOut":"0","arreag":"0","bedCode":"33","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"522","fever":"0","gotAllergy":"0","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"需关注1","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000261","主管护士":"护士01 李秀琴[1900]","住址":"","住院天数":"148","入科":"2019-02-21 14:44","入院":"2019-02-21 14:44:17","出院状态":"","医保号":"","医生":"高洪媛","周天数":"第21周/第1天","就诊号":"522","年龄":"30岁","床位号":"33","性别":"男","总费用":"479.76","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"9520.24","术后天数":"","民族":"汉族","病人姓名":"需关注1","病区":"内分泌科护理单元","病情":"普通","病案号":"100129","登记时间":"2019-02-21 14:39:09","科室":"内分泌科","联系人":"","联系电话":"","诊断":"肩胛区结缔组织良性肿瘤,中暑病,暑证,湿证","费别":"全自费","身份证":""},"regNo":"0000000261","seq":"32","sex":"男","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"30岁","allOut":"0","arreag":"0","bedCode":"34","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"524","fever":"0","gotAllergy":"0","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"需关注3","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000263","主管护士":"","住址":"","住院天数":"148","入科":"2019-02-21 14:44","入院":"2019-02-21 14:44:44","出院状态":"","医保号":"","医生":"医生01","周天数":"第21周/第1天","就诊号":"524","年龄":"30岁","床位号":"34","性别":"男","总费用":"224","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"99776.00","术后天数":"","民族":"汉族","病人姓名":"需关注3","病区":"内分泌科护理单元","病情":"普通","病案号":"100131","登记时间":"2019-02-21 14:41:52","科室":"内分泌科","联系人":"","联系电话":"","诊断":"","费别":"全自费","身份证":""},"regNo":"0000000263","seq":"33","sex":"男","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"30岁","allOut":"0","arreag":"0","bedCode":"35","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"525","fever":"0","gotAllergy":"0","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"需关注4","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000264","主管护士":"","住址":"","住院天数":"148","入科":"2019-02-21 14:44","入院":"2019-02-21 14:44:54","出院状态":"","医保号":"","医生":"医生01","周天数":"第21周/第1天","就诊号":"525","年龄":"30岁","床位号":"35","性别":"男","总费用":"224","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"99776.00","术后天数":"","民族":"汉族","病人姓名":"需关注4","病区":"内分泌科护理单元","病情":"普通","病案号":"100132","登记时间":"2019-02-21 14:42:44","科室":"内分泌科","联系人":"","联系电话":"","诊断":"","费别":"全自费","身份证":""},"regNo":"0000000264","seq":"34","sex":"男","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"27岁","allOut":"0","arreag":"0","bedCode":"36","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"531","fever":"0","gotAllergy":"1","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"皮试","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000267","主管护士":"","住址":"","住院天数":"148","入科":"2019-02-21 17:14","入院":"2019-02-21 17:14:34","出院状态":"","医保号":"","医生":"医生01","周天数":"第21周/第1天","就诊号":"531","年龄":"27岁","床位号":"36","性别":"女","总费用":"224","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"776.00","术后天数":"","民族":"汉族","病人姓名":"皮试","病区":"内分泌科护理单元","病情":"普通","病案号":"100136","登记时间":"2019-02-21 17:11:01","科室":"内分泌科","联系人":"","联系电话":"13649500432","诊断":"肩胛区结缔组织良性肿瘤","费别":"全自费","身份证":""},"regNo":"0000000267","seq":"35","sex":"女","skinOrd":[{"arcimName":"青霉素G钠","skinTestInfo":"阴性","stDate":"2019-02-21"}],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"23岁","allOut":"0","arreag":"0","bedCode":"38","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"164","fever":"0","gotAllergy":"0","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"芦荟","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000132","主管护士":"护士01","住址":"","住院天数":"150","入科":"2019-02-19 10:06","入院":"2019-02-19 10:06:54","出院状态":"","医保号":"","医生":"医生01","周天数":"第21周/第3天","就诊号":"164","年龄":"23岁","床位号":"38","性别":"男","总费用":"360.6","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"3639.40","术后天数":"","民族":"汉族","病人姓名":"芦荟","病区":"内分泌科护理单元","病情":"普通","病案号":"100050","登记时间":"2019-02-12 13:01:33","科室":"内分泌科","联系人":"","联系电话":"","诊断":"肩胛区结缔组织良性肿瘤","费别":"全自费","身份证":""},"regNo":"0000000132","seq":"36","sex":"男","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"5月9天","allOut":"0","arreag":"0","bedCode":"39","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"163","fever":"0","gotAllergy":"0","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"HAPPY","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000131","主管护士":"护士01 李秀琴[1900]","住址":"","住院天数":"151","入科":"2019-02-18 11:27","入院":"2019-02-18 11:27:43","出院状态":"","医保号":"","医生":"陆玉梅","周天数":"第21周/第4天","就诊号":"163","年龄":"5月9天","床位号":"39","性别":"男","总费用":"320","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"3680.00","术后天数":"","民族":"汉族","病人姓名":"HAPPY","病区":"内分泌科护理单元","病情":"普通","病案号":"100049","登记时间":"2019-02-12 12:59:08","科室":"内分泌科","联系人":"","联系电话":"","诊断":"","费别":"全自费","身份证":""},"regNo":"0000000131","seq":"37","sex":"男","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"29岁","allOut":"0","arreag":"0","bedCode":"40","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"512","fever":"0","gotAllergy":"0","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"220001","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000258","主管护士":"护士01","住址":"","住院天数":"149","入科":"2019-02-20 19:09","入院":"2019-02-20 18:47:41","出院状态":"","医保号":"","医生":"医生01","周天数":"第21周/第2天","就诊号":"512","年龄":"29岁","床位号":"40","性别":"女","总费用":"260.07","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"49739.93","术后天数":"","民族":"汉族","病人姓名":"220001","病区":"内分泌科护理单元","病情":"普通","病案号":"100126","登记时间":"2019-02-20 18:46:14","科室":"内分泌科","联系人":"","联系电话":"15565432345","诊断":"健忘病","费别":"全自费","身份证":""},"regNo":"0000000258","seq":"38","sex":"女","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"23岁","allOut":"0","arreag":"0","bedCode":"41","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"215","fever":"0","gotAllergy":"0","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"弄玉","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000113","主管护士":"","住址":"","住院天数":"155","入科":"2019-02-28 09:08","入院":"2019-02-14 11:16:09","出院状态":"","医保号":"","医生":"医生01","周天数":"第22周/第1天","就诊号":"215","年龄":"23岁","床位号":"41","性别":"女","总费用":"471","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"2529.00","术后天数":"","民族":"汉族","病人姓名":"弄玉","病区":"内分泌科护理单元","病情":"普通","病案号":"100077","登记时间":"2019-02-14 11:13:39","科室":"内分泌科","联系人":"","联系电话":"18678602718","诊断":"发热","费别":"全自费","身份证":""},"regNo":"0000000113","seq":"39","sex":"女","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"23岁","allOut":"0","arreag":"0","bedCode":"43","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"595","fever":"0","gotAllergy":"0","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"玛奇朵","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000297","主管护士":"护士01","住址":"","住院天数":"142","入科":"2019-02-27 14:39","入院":"2019-02-27 14:39:45","出院状态":"","医保号":"","医生":"李文明","周天数":"第20周/第2天","就诊号":"595","年龄":"23岁","床位号":"43","性别":"女","总费用":"32","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"-32.00","术后天数":"","民族":"汉族","病人姓名":"玛奇朵","病区":"内分泌科护理单元","病情":"普通","病案号":"100142","登记时间":"2019-02-27 14:39:19","科室":"内分泌科","联系人":"","联系电话":"13695428452","诊断":"交感性眼炎","费别":"职工医保","身份证":""},"regNo":"0000000297","seq":"40","sex":"女","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"23岁","allOut":"0","arreag":"0","bedCode":"44","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"352","fever":"0","gotAllergy":"0","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"领药审核","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000205","主管护士":"护士01","住址":"","住院天数":"153","入科":"2019-02-16 09:45","入院":"2019-02-16 09:45:37","出院状态":"医生撤销出院","医保号":"","医生":"医生01","周天数":"第21周/第6天","就诊号":"352","年龄":"23岁","床位号":"44","性别":"女","总费用":"384","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"49616.00","术后天数":"","民族":"汉族","病人姓名":"领药审核","病区":"内分泌科护理单元","病情":"普通","病案号":"100092","登记时间":"2019-02-16 09:44:26","科室":"内分泌科","联系人":"","联系电话":"15748569685","诊断":"高血压2级,高血压1级","费别":"全自费","身份证":""},"regNo":"0000000205","seq":"41","sex":"女","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"21岁","allOut":"0","arreag":"0","bedCode":"46","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"593","fever":"0","gotAllergy":"0","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"2001yh","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000296","主管护士":"护士01","住址":"","住院天数":"142","入科":"2019-02-27 13:30","入院":"2019-02-27 13:30:21","出院状态":"","医保号":"","医生":"医生01","周天数":"第20周/第2天","就诊号":"593","年龄":"21岁","床位号":"46","性别":"女","总费用":"92","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"9999908.00","术后天数":"","民族":"汉族","病人姓名":"2001yh","病区":"内分泌科护理单元","病情":"普通","病案号":"100141","登记时间":"2019-02-27 13:26:55","科室":"内分泌科","联系人":"","联系电话":"13001301010","诊断":"副肾","费别":"全自费","身份证":""},"regNo":"0000000296","seq":"42","sex":"女","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"25岁","allOut":"0","arreag":"1","bedCode":"47","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"86","fever":"0","gotAllergy":"0","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"myh0202","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000083","主管护士":"李秀琴[1900]","住址":"","住院天数":"167","入科":"2019-02-02 09:35","入院":"2019-02-02 09:35:15","出院状态":"","医保号":"","医生":"讲亚飞","周天数":"第23周/第6天","就诊号":"86","年龄":"25岁","床位号":"47","性别":"女","总费用":"1197.37","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"-167.37","术后天数":"","民族":"汉族","病人姓名":"myh0202","病区":"内分泌科护理单元","病情":"普通","病案号":"100031","登记时间":"2019-02-02 08:59:30","科室":"内分泌科","联系人":"","联系电话":"","诊断":"伤寒,便秘","费别":"全自费","身份证":""},"regNo":"0000000083","seq":"43","sex":"女","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"28岁","allOut":"0","arreag":"0","bedCode":"48","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"502","fever":"0","gotAllergy":"0","illState":"","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"白菜","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000253","主管护士":"李秀琴[1900]","住址":"","住院天数":"149","入科":"2019-02-20 14:12","入院":"2019-02-20 13:54:55","出院状态":"","医保号":"","医生":"讲亚飞","周天数":"第21周/第2天","就诊号":"502","年龄":"28岁","床位号":"48","性别":"女","总费用":"401.2","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"2598.80","术后天数":"","民族":"汉族","病人姓名":"白菜","病区":"内分泌科护理单元","病情":"普通","病案号":"100121","登记时间":"2019-02-20 13:48:11","科室":"消化内科","联系人":"","联系电话":"","诊断":"多胎分娩","费别":"全自费","身份证":""},"regNo":"0000000253","seq":"44","sex":"女","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"23岁","allOut":"0","arreag":"0","bedCode":"50","careLevel":"一级护理","criticalValue":"0","dangerous":"1","docDisch":"0","episodeId":"243","fever":"0","gotAllergy":"0","illState":"病危","inBedAll":"1","longOrd":"0","manageInBed":"0","name":"住院单测试","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000163","主管护士":"护士01","住址":"","住院天数":"156","入科":"2019-02-13 13:49","入院":"2019-02-13 13:49:24","出院状态":"","医保号":"","医生":"医生01","周天数":"第22周/第2天","就诊号":"243","年龄":"23岁","床位号":"50","性别":"女","总费用":"9363.71","房间":"内分泌1病室","手术":"","护理级别":"一级护理","押金余额":"190636.29","术后天数":"","民族":"汉族","病人姓名":"住院单测试","病区":"内分泌科护理单元","病情":"病危","病案号":"100067","登记时间":"2019-02-13 13:44:07","科室":"内分泌科","联系人":"","联系电话":"17585968521","诊断":"肾性高血压","费别":"全自费","身份证":""},"regNo":"0000000163","seq":"45","sex":"女","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"0"},{"age":"33岁","allOut":"0","arreag":"0","bedCode":"","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"1","episodeId":"175","fever":"0","gotAllergy":"0","illState":"","inBedAll":"0","longOrd":"0","manageInBed":"0","name":"yw伍嘉云","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000044","主管护士":"护士01","住址":"","住院天数":"1","入科":"2019-02-21 09:00","入院":"2019-02-21 09:00:12","出院状态":"医嘱出院 ","医保号":"","医生":"医生01","周天数":"第1天","就诊号":"175","年龄":"33岁","床位号":"","性别":"女","总费用":"71.4","房间":"","手术":"","护理级别":"","押金余额":"9928.60","术后天数":"","民族":"","病人姓名":"yw伍嘉云","病区":"内分泌科护理单元","病情":"普通","病案号":"100056","登记时间":"2019-02-12 14:00:19","科室":"内分泌科","联系人":"","联系电话":"15678989098","诊断":"沙门菌胃肠炎,高血压2级","费别":"全自费","身份证":"440901198508232667 "},"regNo":"0000000044","seq":"46","sex":"女","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"1"},{"age":"30岁","allOut":"0","arreag":"0","bedCode":"","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"523","fever":"0","gotAllergy":"0","illState":"","inBedAll":"0","longOrd":"0","manageInBed":"0","name":"需关注2","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000262","主管护士":"","住址":"","住院天数":"148","入科":"2019-02-21 14:44","入院":"2019-02-21 14:44:31","出院状态":"","医保号":"","医生":"医生01","周天数":"第21周/第1天","就诊号":"523","年龄":"30岁","床位号":"","性别":"男","总费用":"224","房间":"","手术":"","护理级别":"","押金余额":"9776.00","术后天数":"","民族":"汉族","病人姓名":"需关注2","病区":"内分泌科护理单元","病情":"普通","病案号":"100130","登记时间":"2019-02-21 14:40:59","科室":"内分泌科","联系人":"","联系电话":"","诊断":"","费别":"全自费","身份证":""},"regNo":"0000000262","seq":"47","sex":"男","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"1"},{"age":"24岁","allOut":"0","arreag":"0","bedCode":"","careLevel":"一级护理","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"393","fever":"0","gotAllergy":"0","illState":"","inBedAll":"0","longOrd":"0","manageInBed":"0","name":"住院测试","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000226","主管护士":"护士01","住址":"","住院天数":"151","入科":"2019-02-18 09:39","入院":"2019-02-18 09:39:15","出院状态":"","医保号":"","医生":"医生01","周天数":"第21周/第4天","就诊号":"393","年龄":"24岁","床位号":"","性别":"女","总费用":"500.45","房间":"","手术":"","护理级别":"一级护理","押金余额":"49499.55","术后天数":"","民族":"汉族","病人姓名":"住院测试","病区":"内分泌科护理单元","病情":"普通","病案号":"100105","登记时间":"2019-02-18 09:37:48","科室":"内分泌科","联系人":"","联系电话":"17548547569","诊断":"高血压2级","费别":"全自费","身份证":""},"regNo":"0000000226","seq":"48","sex":"女","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"1"},{"age":"26岁","allOut":"0","arreag":"0","bedCode":"","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"61","fever":"0","gotAllergy":"0","illState":"","inBedAll":"0","longOrd":"0","manageInBed":"0","name":"住院测H00","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000058","主管护士":"汪丽华 王娟[3357]","住址":"","住院天数":"8","入科":"2019-07-11 14:50","入院":"2019-07-11 14:50:29","出院状态":"","医保号":"","医生":"李文明","周天数":"第1周/第1天","就诊号":"61","年龄":"26岁","床位号":"","性别":"未知性别","总费用":"0","房间":"","手术":"","护理级别":"","押金余额":"1000.00","术后天数":"","民族":"汉族","病人姓名":"住院测H00","病区":"内分泌科护理单元","病情":"普通","病案号":"100022","登记时间":"2019-02-01 11:17:01","科室":"内分泌科","联系人":"","联系电话":"15651961517","诊断":"","费别":"全自费","身份证":""},"regNo":"0000000058","seq":"49","sex":"未知性别","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"1"},{"age":"44岁","allOut":"0","arreag":"1","bedCode":"","careLevel":"","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"197","fever":"0","gotAllergy":"0","illState":"","inBedAll":"0","longOrd":"0","manageInBed":"0","name":"yw曹芷若","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000143","主管护士":"汪丽华","住址":"","住院天数":"8","入科":"2019-07-11 14:53","入院":"2019-07-11 14:53:07","出院状态":"","医保号":"","医生":"医生01","周天数":"第1周/第1天","就诊号":"197","年龄":"44岁","床位号":"","性别":"女","总费用":"0","房间":"","手术":"","护理级别":"","押金余额":"0.00","术后天数":"","民族":"汉族","病人姓名":"yw曹芷若","病区":"内分泌科护理单元","病情":"普通","病案号":"100059","登记时间":"2019-02-12 15:22:23","科室":"内分泌科","联系人":"","联系电话":"15567778890","诊断":"咽囊","费别":"全自费","身份证":"440901197501231800 "},"regNo":"0000000143","seq":"50","sex":"女","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"1"},{"age":"37岁","allOut":"0","arreag":"0","bedCode":"","careLevel":"特级护理","criticalValue":"0","dangerous":"0","docDisch":"0","episodeId":"4","fever":"0","gotAllergy":"0","illState":"","inBedAll":"0","longOrd":"0","manageInBed":"0","name":"张衣","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000008","主管护士":"李娇","住址":"","住院天数":"169","入科":"2019-01-31 14:24","入院":"2019-01-31 14:24:24","出院状态":"","医保号":"","医生":"医生01","周天数":"第24周/第1天","就诊号":"4","年龄":"37岁","床位号":"","性别":"女","总费用":"3038.48","房间":"","手术":"","护理级别":"特级护理","押金余额":"996960.52","术后天数":"","民族":"","病人姓名":"张衣","病区":"内分泌科护理单元","病情":"普通","病案号":"100003","登记时间":"2019-01-31 09:32:42","科室":"内分泌科","联系人":"","联系电话":"13236536655","诊断":"副伤寒,头痛,疼痛","费别":"全自费","身份证":"360822198207071368 "},"regNo":"0000000008","seq":"51","sex":"女","skinOrd":[{"arcimName":"青霉素G钠","skinTestInfo":"阴性","stDate":"2019-02-18"}],"tempOrd":"0","todayOut":"0","wait":"1"},{"age":"24岁","allOut":"0","arreag":"0","bedCode":"","careLevel":"一级护理","criticalValue":"0","dangerous":"1","docDisch":"0","episodeId":"67","fever":"0","gotAllergy":"0","illState":"病危","inBedAll":"0","longOrd":"0","manageInBed":"0","name":"198yh","newPatient":"0","operation":"","patInfoDetail":{"ID":"0000000061","主管护士":"李秀琴[1900]","住址":"","住院天数":"168","入科":"2019-02-01 14:47","入院":"2019-02-01 14:47:18","出院状态":"","医保号":"","医生":"医生01","周天数":"第24周/第0天","就诊号":"67","年龄":"24岁","床位号":"","性别":"女","总费用":"1537.7","房间":"","手术":"","护理级别":"一级护理","押金余额":"998462.30","术后天数":"","民族":"","病人姓名":"198yh","病区":"内分泌科护理单元","病情":"病危","病案号":"100025","登记时间":"2019-02-01 14:44:29","科室":"内分泌科","联系人":"","联系电话":"","诊断":"高血压3级,乳腺肿瘤","费别":"全自费","身份证":""},"regNo":"0000000061","seq":"52","sex":"女","skinOrd":[],"tempOrd":"0","todayOut":"0","wait":"1"}]
     * status : 0
     * topFilter : [{"code":"inBedAll","desc":"全区"},{"code":"manageInBed","desc":"管辖"},{"code":"wait","desc":"等候"}]
     */

    private String msg;
    private String msgcode;
    private String status;
    private List<PatInfoListBean> patInfoList;
    private List<TopFilterBean> topFilter;

    public String getMsg() {
        return msg;
    }

    public void setMsg(String msg) {
        this.msg = msg;
    }

    public String getMsgcode() {
        return msgcode;
    }

    public void setMsgcode(String msgcode) {
        this.msgcode = msgcode;
    }

    public String getStatus() {
        return status;
    }

    public void setStatus(String status) {
        this.status = status;
    }

    public List<PatInfoListBean> getPatInfoList() {
        return patInfoList;
    }

    public void setPatInfoList(List<PatInfoListBean> patInfoList) {
        this.patInfoList = patInfoList;
    }

    public List<TopFilterBean> getTopFilter() {
        return topFilter;
    }

    public void setTopFilter(List<TopFilterBean> topFilter) {
        this.topFilter = topFilter;
    }

    public static class PatInfoListBean {
        /**
         * age : 19岁
         * allOut : 0
         * arreag : 0
         * bedCode : 01
         * careLevel :
         * criticalValue : 0
         * dangerous : 0
         * docDisch : 1
         * episodeId : 640
         * fever : 0
         * gotAllergy : 0
         * illState :
         * inBedAll : 1
         * longOrd : 0
         * manageInBed : 0
         * name : 张三
         * newPatient : 0
         * operation :
         * patInfoDetail : {"ID":"0000000303","主管护士":"汪丽华","住址":"","住院天数":"1","入科":"2019-07-18 09:54","入院":"2019-07-18 09:54:26","出院状态":"医嘱出院 ","医保号":"","医生":"高洪媛","周天数":"第1天","就诊号":"640","年龄":"19岁","床位号":"01","性别":"男","总费用":"96.37","房间":"内分泌1病室","手术":"","护理级别":"","押金余额":"903.63","术后天数":"","民族":"汉族","病人姓名":"张三","病区":"内分泌科护理单元","病情":"普通","病案号":"100144","登记时间":"2019-07-18 09:34:54","科室":"内分泌科","联系人":"","联系电话":"13215151515","诊断":"高血压1级,脑内出血","费别":"全自费","身份证":""}
         * regNo : 0000000303
         * seq : 1
         * sex : 男
         * skinOrd : []
         * tempOrd : 0
         * todayOut : 0
         * wait : 0
         */

        private String age;
        private String allOut;
        private String arreag;
        private String bedCode;
        private String careLevel;
        private String criticalValue;
        private String dangerous;
        private String docDisch;
        private String episodeId;
        private String fever;
        private String gotAllergy;
        private String illState;
        private String inBedAll;
        private String longOrd;
        private String manageInBed;
        private String name;
        private String newPatient;
        private String operation;
        private PatInfoDetailBean patInfoDetail;
        private String regNo;
        private String seq;
        private String sex;
        private String tempOrd;
        private String todayOut;
        private String wait;
        private List<?> skinOrd;

        public String getAge() {
            return age;
        }

        public void setAge(String age) {
            this.age = age;
        }

        public String getAllOut() {
            return allOut;
        }

        public void setAllOut(String allOut) {
            this.allOut = allOut;
        }

        public String getArreag() {
            return arreag;
        }

        public void setArreag(String arreag) {
            this.arreag = arreag;
        }

        public String getBedCode() {
            return bedCode;
        }

        public void setBedCode(String bedCode) {
            this.bedCode = bedCode;
        }

        public String getCareLevel() {
            return careLevel;
        }

        public void setCareLevel(String careLevel) {
            this.careLevel = careLevel;
        }

        public String getCriticalValue() {
            return criticalValue;
        }

        public void setCriticalValue(String criticalValue) {
            this.criticalValue = criticalValue;
        }

        public String getDangerous() {
            return dangerous;
        }

        public void setDangerous(String dangerous) {
            this.dangerous = dangerous;
        }

        public String getDocDisch() {
            return docDisch;
        }

        public void setDocDisch(String docDisch) {
            this.docDisch = docDisch;
        }

        public String getEpisodeId() {
            return episodeId;
        }

        public void setEpisodeId(String episodeId) {
            this.episodeId = episodeId;
        }

        public String getFever() {
            return fever;
        }

        public void setFever(String fever) {
            this.fever = fever;
        }

        public String getGotAllergy() {
            return gotAllergy;
        }

        public void setGotAllergy(String gotAllergy) {
            this.gotAllergy = gotAllergy;
        }

        public String getIllState() {
            return illState;
        }

        public void setIllState(String illState) {
            this.illState = illState;
        }

        public String getInBedAll() {
            return inBedAll;
        }

        public void setInBedAll(String inBedAll) {
            this.inBedAll = inBedAll;
        }

        public String getLongOrd() {
            return longOrd;
        }

        public void setLongOrd(String longOrd) {
            this.longOrd = longOrd;
        }

        public String getManageInBed() {
            return manageInBed;
        }

        public void setManageInBed(String manageInBed) {
            this.manageInBed = manageInBed;
        }

        public String getName() {
            return name;
        }

        public void setName(String name) {
            this.name = name;
        }

        public String getNewPatient() {
            return newPatient;
        }

        public void setNewPatient(String newPatient) {
            this.newPatient = newPatient;
        }

        public String getOperation() {
            return operation;
        }

        public void setOperation(String operation) {
            this.operation = operation;
        }

        public PatInfoDetailBean getPatInfoDetail() {
            return patInfoDetail;
        }

        public void setPatInfoDetail(PatInfoDetailBean patInfoDetail) {
            this.patInfoDetail = patInfoDetail;
        }

        public String getRegNo() {
            return regNo;
        }

        public void setRegNo(String regNo) {
            this.regNo = regNo;
        }

        public String getSeq() {
            return seq;
        }

        public void setSeq(String seq) {
            this.seq = seq;
        }

        public String getSex() {
            return sex;
        }

        public void setSex(String sex) {
            this.sex = sex;
        }

        public String getTempOrd() {
            return tempOrd;
        }

        public void setTempOrd(String tempOrd) {
            this.tempOrd = tempOrd;
        }

        public String getTodayOut() {
            return todayOut;
        }

        public void setTodayOut(String todayOut) {
            this.todayOut = todayOut;
        }

        public String getWait() {
            return wait;
        }

        public void setWait(String wait) {
            this.wait = wait;
        }

        public List<?> getSkinOrd() {
            return skinOrd;
        }

        public void setSkinOrd(List<?> skinOrd) {
            this.skinOrd = skinOrd;
        }

        public static class PatInfoDetailBean {
            /**
             * ID : 0000000303
             * 主管护士 : 汪丽华
             * 住址 :
             * 住院天数 : 1
             * 入科 : 2019-07-18 09:54
             * 入院 : 2019-07-18 09:54:26
             * 出院状态 : 医嘱出院
             * 医保号 :
             * 医生 : 高洪媛
             * 周天数 : 第1天
             * 就诊号 : 640
             * 年龄 : 19岁
             * 床位号 : 01
             * 性别 : 男
             * 总费用 : 96.37
             * 房间 : 内分泌1病室
             * 手术 :
             * 护理级别 :
             * 押金余额 : 903.63
             * 术后天数 :
             * 民族 : 汉族
             * 病人姓名 : 张三
             * 病区 : 内分泌科护理单元
             * 病情 : 普通
             * 病案号 : 100144
             * 登记时间 : 2019-07-18 09:34:54
             * 科室 : 内分泌科
             * 联系人 :
             * 联系电话 : 13215151515
             * 诊断 : 高血压1级,脑内出血
             * 费别 : 全自费
             * 身份证 :
             */

            private String ID;
            private String 主管护士;
            private String 住址;
            private String 住院天数;
            private String 入科;
            private String 入院;
            private String 出院状态;
            private String 医保号;
            private String 医生;
            private String 周天数;
            private String 就诊号;
            private String 年龄;
            private String 床位号;
            private String 性别;
            private String 总费用;
            private String 房间;
            private String 手术;
            private String 护理级别;
            private String 押金余额;
            private String 术后天数;
            private String 民族;
            private String 病人姓名;
            private String 病区;
            private String 病情;
            private String 病案号;
            private String 登记时间;
            private String 科室;
            private String 联系人;
            private String 联系电话;
            private String 诊断;
            private String 费别;
            private String 身份证;

            public String getID() {
                return ID;
            }

            public void setID(String ID) {
                this.ID = ID;
            }

            public String get主管护士() {
                return 主管护士;
            }

            public void set主管护士(String 主管护士) {
                this.主管护士 = 主管护士;
            }

            public String get住址() {
                return 住址;
            }

            public void set住址(String 住址) {
                this.住址 = 住址;
            }

            public String get住院天数() {
                return 住院天数;
            }

            public void set住院天数(String 住院天数) {
                this.住院天数 = 住院天数;
            }

            public String get入科() {
                return 入科;
            }

            public void set入科(String 入科) {
                this.入科 = 入科;
            }

            public String get入院() {
                return 入院;
            }

            public void set入院(String 入院) {
                this.入院 = 入院;
            }

            public String get出院状态() {
                return 出院状态;
            }

            public void set出院状态(String 出院状态) {
                this.出院状态 = 出院状态;
            }

            public String get医保号() {
                return 医保号;
            }

            public void set医保号(String 医保号) {
                this.医保号 = 医保号;
            }

            public String get医生() {
                return 医生;
            }

            public void set医生(String 医生) {
                this.医生 = 医生;
            }

            public String get周天数() {
                return 周天数;
            }

            public void set周天数(String 周天数) {
                this.周天数 = 周天数;
            }

            public String get就诊号() {
                return 就诊号;
            }

            public void set就诊号(String 就诊号) {
                this.就诊号 = 就诊号;
            }

            public String get年龄() {
                return 年龄;
            }

            public void set年龄(String 年龄) {
                this.年龄 = 年龄;
            }

            public String get床位号() {
                return 床位号;
            }

            public void set床位号(String 床位号) {
                this.床位号 = 床位号;
            }

            public String get性别() {
                return 性别;
            }

            public void set性别(String 性别) {
                this.性别 = 性别;
            }

            public String get总费用() {
                return 总费用;
            }

            public void set总费用(String 总费用) {
                this.总费用 = 总费用;
            }

            public String get房间() {
                return 房间;
            }

            public void set房间(String 房间) {
                this.房间 = 房间;
            }

            public String get手术() {
                return 手术;
            }

            public void set手术(String 手术) {
                this.手术 = 手术;
            }

            public String get护理级别() {
                return 护理级别;
            }

            public void set护理级别(String 护理级别) {
                this.护理级别 = 护理级别;
            }

            public String get押金余额() {
                return 押金余额;
            }

            public void set押金余额(String 押金余额) {
                this.押金余额 = 押金余额;
            }

            public String get术后天数() {
                return 术后天数;
            }

            public void set术后天数(String 术后天数) {
                this.术后天数 = 术后天数;
            }

            public String get民族() {
                return 民族;
            }

            public void set民族(String 民族) {
                this.民族 = 民族;
            }

            public String get病人姓名() {
                return 病人姓名;
            }

            public void set病人姓名(String 病人姓名) {
                this.病人姓名 = 病人姓名;
            }

            public String get病区() {
                return 病区;
            }

            public void set病区(String 病区) {
                this.病区 = 病区;
            }

            public String get病情() {
                return 病情;
            }

            public void set病情(String 病情) {
                this.病情 = 病情;
            }

            public String get病案号() {
                return 病案号;
            }

            public void set病案号(String 病案号) {
                this.病案号 = 病案号;
            }

            public String get登记时间() {
                return 登记时间;
            }

            public void set登记时间(String 登记时间) {
                this.登记时间 = 登记时间;
            }

            public String get科室() {
                return 科室;
            }

            public void set科室(String 科室) {
                this.科室 = 科室;
            }

            public String get联系人() {
                return 联系人;
            }

            public void set联系人(String 联系人) {
                this.联系人 = 联系人;
            }

            public String get联系电话() {
                return 联系电话;
            }

            public void set联系电话(String 联系电话) {
                this.联系电话 = 联系电话;
            }

            public String get诊断() {
                return 诊断;
            }

            public void set诊断(String 诊断) {
                this.诊断 = 诊断;
            }

            public String get费别() {
                return 费别;
            }

            public void set费别(String 费别) {
                this.费别 = 费别;
            }

            public String get身份证() {
                return 身份证;
            }

            public void set身份证(String 身份证) {
                this.身份证 = 身份证;
            }
        }
    }

    public static class TopFilterBean {
        /**
         * code : inBedAll
         * desc : 全区
         */

        private String code;
        private String desc;

        public String getCode() {
            return code;
        }

        public void setCode(String code) {
            this.code = code;
        }

        public String getDesc() {
            return desc;
        }

        public void setDesc(String desc) {
            this.desc = desc;
        }
    }
}
